Revit 2027 API
MEPBuildingConstruction.GetBuildingConstructionOverride Method
Gets the Building Construction override for a ConstructionType.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetBuildingConstructionOverride(
	ConstructionType constructionType
)
Public Function GetBuildingConstructionOverride (
	constructionType As ConstructionType
) As Boolean
public:
bool GetBuildingConstructionOverride(
	ConstructionType constructionType
)
member GetBuildingConstructionOverride :
        constructionType : ConstructionType -> bool
Parameters
constructionType ConstructionType
The ConstructionType override value to get.
Return Value
Boolean
True if analytical construction properties specified in Constructions.xml are used for the given ConstructionType, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The ConstructionType is invalid.
See Also
Reference
MEPBuildingConstruction Class
Autodesk.Revit.DB.Mechanical Namespace